package alokhina.lab1

object task5_1 extends App{
  // Напишіть програму, яка генерує масив з n випадок-них чисел
  // (де n - досить велике значення, наприклад 1 000 000) і потім обчислює середнє значення,
  // розподіляючи роботу між декількома акторами, кожен з яких обчислює суму
  // для фрагмента масиву і відправляє результат актору , що об'єднує результати.
  // Який приріст в швидкості вийде при виконанні програми на дво- або
  // чотирьохядерному процесорі в порівнянні з однопоточному реалізацією?

}

object task5_2 extends App{
  // Напишіть програму, яка читає велике зображення в екземпляр BufferedImage
  // за допомогою javax.imageio.IOImage.read.

}

object task5_3 extends App{
  // Реалізуйте кілька акторів, кожен з яких інвертує кольору
  // в своїй смузі зображення. Після обробки всіх смуг збережіть результат.

}

object task5_4 extends App{
  // Напишіть програму, підраховують кількість збігів із заданим регулярним виразом у всіх файлах,
  // у всіх підкаталогах, починаючи з зазначеного каталогу. Створіть по одному актору для кожного файлу,
  // один актор для обходу дерева підкаталогів і один актор для збору результатів.

}

object task5_5 extends App{
  // Змініть програму з попередньої вправи так, щоб вона виводила знайдені збіги.

}

object task5_6 extends App{
  // Змініть програму з попередньої вправи так, щоб для кожного збігу виводився
  // список всіх файлів, де це збіг було знайдено.

}

